[
    {
        "id": "a5a8634a-339f-442e-b50f-4ba2a98d84c8",
        "title": "test file",
        "data": "this is just a file",
        "url": "https://www.appu.com",
        "created_at": "2025-12-29T21:26:29.127068"
    },
    {
        "id": "ccdc6f6c-b21f-416e-bdbe-b720a905667a",
        "title": "Firewall",
        "data": "Firewall may refer to:\n\nFirewall (computing), a technological barrier designed to prevent unauthorized or unwanted communications between computer networks or hosts\nFirewall (construction), a barrier inside a building, designed to limit the spread of fire, heat and structural collapse\nFirewall (engine), the part of a vehicle that separates the engine compartment from the rest of the vehicle\nFirewall (physics), a hypothetical phenomenon where a freely falling observer spontaneously burns up at the horizon of a black hole\nFirewall (politics), also known as cordon sanitaire: the refusal of one or more political parties to cooperate with certain other political parties.\nFor example, see Firewall against the far-right in Germany",
        "url": "https://en.wikipedia.org/wiki/Firewall",
        "created_at": "2025-12-29T21:33:58.640039"
    },
    {
        "id": "04f0b373-bba8-4808-91cf-ae30f306bce2",
        "title": "Firewall: Zero Hour",
        "data": "Gameplay\nFirewall: Zero Hour is an online, or offline via training, virtual reality tactical action shooter where players called contractors take on contracts issued from agents who are known as mother and father. Each contractor has a different passive skill for use on the field which can help support the player fend off the enemy team from completing their objective. There are 12 contractors players can choose from all with a set primary skill and a secondary skill you can edit. Weapon loadouts are also customizable where players can pick a primary weapon, secondary weapon, one lethal equipment and one nonlethal equipment. Taking on contracts players will receive experience for certain actions they complete, as well as earning in-game currency known as \"Crypto\" where both can be found scattered around the map or completing the contract.",
        "url": "https://en.wikipedia.org/wiki/Firewall%3A_Zero_Hour",
        "created_at": "2025-12-29T21:34:18.496223"
    },
    {
        "id": "efa7a4d6-1fe3-432e-950c-7e5ffebb43c9",
        "title": "Windows Server 2025",
        "data": "Overview\nWindows Server 2025 delivers security advancements and new hybrid cloud capabilities in a high-performance, AI-capable platform. Download now to evaluate Windows Server 2025 features. \n\nIn addition to your trial experience of Windows Server 2025, you can more easily add and manage languages and Features on Demand with the new Languages and Optional Features ISO. Download this ISO.\n\nThis ISO is only available on Windows Server 2025 and combines the previously separate Features on Demand and Language Packs ISOs, and can be used as a FOD and Language pack repository. To learn about Features on Demand, see Features on Demand. To learn about adding languages, see Add Languages.\n\nGet started for free\nPlease select your product experience:\n \n\nTry Windows Server on Azure\nDownload the ISO\nDownload the VHD\nDescription\nMicrosoft Windows Server 2025 prepares you for tomorrow while delivering the security, performance, and flexibility you need today. Be more productive with easier networking, faster storage, and hybrid cloud capabilities that adapt to your needs. Get ahead of what’s next with forward-looking security, and AI-ready compute.\n\nSome key improvements include:\nHybrid: Adapt quickly across hybrid, cloud and edge. Easier to connect to Azure Arc to bridge on-premises and cloud-based servers. Deliver Azure capabilities to your on-premises servers.\nSecurity: Hardware and software-level security to deter cyberattacks; next-generation Active Directory that improves security and scalability. Enable a tailored security baseline and  configure drift protection from the start.\nModern, future-ready platform: Windows Server 2025 is now easier to upgrade and scale, with better-than-ever app compatibility. Windows Server 2025 desktop brings consistent client and server UI experience, plus conveniences like WiFi and Bluetooth.\nPerformance: Faster and easier networking and storage; live hotpatching for reduced downtime; GPU partitioning for inferencing at the edge. Improvements in flash-based storage make Windows Server an even better platform for SQL Server.",
        "url": "https://www.microsoft.com/en-us/evalcenter/evaluate-windows-server-2025",
        "created_at": "2025-12-29T21:35:09.496722"
    },
    {
        "id": "423e2751-7fed-439e-8d38-b298ab85b87c",
        "title": "Windows Server 2025",
        "data": "Get started for free\nPlease select your product experience:\n \n\nTry Windows Server on Azure\nDownload the ISO\nDownload the VHD\nDescription\nMicrosoft Windows Server 2025 prepares you for tomorrow while delivering the security, performance, and flexibility you need today. Be more productive with easier networking, faster storage, and hybrid cloud capabilities that adapt to your needs. Get ahead of what’s next with forward-looking security, and AI-ready compute.\n\nSome key improvements include:\nHybrid: Adapt quickly across hybrid, cloud and edge. Easier to connect to Azure Arc to bridge on-premises and cloud-based servers. Deliver Azure capabilities to your on-premises servers.\nSecurity: Hardware and software-level security to deter cyberattacks; next-generation Active Directory that improves security and scalability. Enable a tailored security baseline and  configure drift protection from the start.\nModern, future-ready platform: Windows Server 2025 is now easier to upgrade and scale, with better-than-ever app compatibility. Windows Server 2025 desktop brings consistent client and server UI experience, plus conveniences like WiFi and Bluetooth.\nPerformance: Faster and easier networking and storage; live hotpatching for reduced downtime; GPU partitioning for inferencing at the edge. Improvements in flash-based storage make Windows Server an even better platform for SQL Server.",
        "url": "https://www.microsoft.com/en-us/evalcenter/evaluate-windows-server-2025",
        "created_at": "2025-12-29T21:36:29.336780"
    },
    {
        "id": "4b136459-ea54-4805-8f3c-86d87c7e768b",
        "title": "HTML Test Entry",
        "data": "<h1>HTML Rendering Test</h1><p>This is <b>bold text</b>, this is <i>italic text</i>, and this is a <a href='#'>test link</a>.</p><ul><li>Item 1</li><li>Item 2</li><li>Item 3</li></ul><p>Adding more lines to test scrolling if necessary. Line 1.<br>Line 2.<br>Line 3.<br>Line 4.<br>Line 5.<br>Line 6.<br>Line 7.<br>Line 8.<br>Line 9.<br>Line 10.</p> ",
        "url": "",
        "created_at": "2025-12-29T21:53:03.856352"
    },
    {
        "id": "601ca17f-2a49-4e0c-99c5-5af7879d824e",
        "title": "windows 2008",
        "data": "RAM — The following are the RAM requirements:\n\n    Minimum: 512 MB\n    Recommended: 2 GB or more\n    Maximum (32-bit systems): 4 GB (for Windows Server 2008 Standard) or 64 GB (for Windows Server 2008 Enterprise or Windows Server 2008 Datacenter)\n    Maximum (64-bit systems): 32 GB (for Windows Server 2008 Standard) or 2 terabyte (for Windows Server 2008 Enterprise, Windows Server 2008 Datacenter, or Windows Server® 2008 for Itanium-Based Systems)\n\nDisk space requirements —The following are the approximate disk space requirements for the system partition. Itanium-based and x64-based operating systems will vary from these estimates. Additional disk space may be required if you install the system over a network:\n\n    Minimum: 10 GB\n\n    Recommended: 40 GB or more\n\n    Note\n\n    Computers with more than 16 GB of RAM require more disk space for paging, hibernation, and dump files.\n\n    DVD-ROM drive\n\n    Super VGA (800 x 600) or higher-resolution monitor\n\n    Keyboard and mouse (or other compatible pointing device)\n",
        "url": "https://www.microsoft.com",
        "created_at": "2025-12-29T21:56:45.535698"
    },
    {
        "id": "8caf3dac-d53f-4b07-9971-6f0c4f9b1bee",
        "title": "How to install Python on Windows",
        "data": "Python is a high-level programming language that is widely used because it is easy to learn, flexible, and powerful. It is used in many fields such as web development, data science, automation, and software development. Installing Python on a Windows computer is a simple process and only takes a few basic steps.\n\nHow to Install Python in Windows\nTo download Python on your system, you can use the following steps:\n\nStep 1: Choose the Python Version to Install\nOpen your web browser and visit the official Python website: https://www.python.org/downloads/%3C/span>\n\nOn the downloads page, look for the latest stable version of Python 3 (Python 3.10 or newer is recommended). Choose the correct installer based on your system type:\n\nWindows installer (64-bit): for most modern computers\nWindows installer (32-bit): for older systems\nClick the installer link to download the .exe file.",
        "url": "",
        "created_at": "2025-12-29T21:58:08.037738"
    },
    {
        "id": "76fb2249-4234-404e-bdfd-c488a4e28fce",
        "title": "Installation",
        "data": "Prerequisites\nReview Windows Server 2025 release notes and system requirements. \nRegister, then download and install. (Note: This evaluation edition expires in 180 days.)\nInstallation Guidelines\nAfter installation, install the latest servicing package.\n\nRun Windows Update\nEvaluation versions of Windows Server must be activated over the internet in the first 10 days to avoid automatic shutdown.\nResources\nGetting Started Guide | Get started with Windows Server 2025\nCommunity | Microsoft Tech Community: Windows Server\nMicrosoft Docs | Windows Server technical documentation\nMicrosoft Certified | Hybrid Administrator Certification\nWindows Insider | Get news and previews – Windows Insider Program",
        "url": "",
        "created_at": "2025-12-29T22:08:12.868277"
    },
    {
        "id": "ca305321-af6a-4247-bcd6-a20243bd230e",
        "title": "reminder app",
        "data": "Create a modern Reminder and Task Application in Flask. <div><br></div><div>\n1. The Reminder application should have fields to capture [Title, Description, Date of Reminder, Recurrance [Yearly, weekly, Monthly, Daily]]\n2. The Dashboard should show the upcoming reminder which is within 1 week from current date. Also should have scrolling bar to show reminders upto next 12 weeks. \n3. The Task application should have following fields [Task, Description, Status[Yet to Start, pending, wip, Completed, onhold]]\n4. the Dashboard should contain all the task except Completed one.\n5. Dashboard should have options to create new Reminder and Task content.\n6. Individual tab should be available \n\ta. to show all task and reminders.\n\tb. calendar view for reminders.\n7. the dashboard should only latest comments. \n8. All user data should be saved in to JSON file. \n9. The application should be very color full and modern.  </div>",
        "url": "",
        "created_at": "2025-12-29T22:08:47.099075"
    },
    {
        "id": "f6cfaac7-25aa-4827-a452-9f2c49631b15",
        "title": "demo app",
        "data": "Create a modern Reminder and Task Application in Flask. \n1. The Reminder application should have fields to capture [Title, Description, Date of Reminder, Recurrance [Yearly, weekly, Monthly, Daily]]\n2. The Dashboard should show the upcoming reminder which is within 1 week from current date. Also should have scrolling bar to show reminders upto next 12 weeks. \n3. The Task application should have following fields [Task, Description, Status[Yet to Start, pending, wip, Completed, onhold]]\n4. the Dashboard should contain all the task except Completed one.\n5. Dashboard should have options to create new Reminder and Task content.\n6. Individual tab should be available \n\ta. to show all task and reminders.\n\tb. calendar view for reminders.\n7. the dashboard should only latest comments. \n8. All user data should be saved in to JSON file. \n9. The application should be very color full and modern.  ",
        "url": "",
        "created_at": "2025-12-29T22:16:36.811333"
    },
    {
        "id": "5760ec16-e5fd-4f81-9ee2-0032c9393d90",
        "title": "Install hyper-v",
        "data": "This article shows how to install Hyper-V in Windows and Windows Server. Follow the set of instructions that fit your needs.\n\nEnable Hyper-V to create virtual machines on Windows. Hyper-V can be enabled in many ways including using the Windows control panel, PowerShell, or using the Deployment Imaging Servicing and Management tool (DISM). This article walks through each option.\n\n Note\n\nHyper-V is built into Windows as an optional feature--there's no Hyper-V download.\n\nCheck requirements for Windows\nWindows 10 (Pro or Enterprise), or Windows 11 (Pro or Enterprise)\n64-bit Processor with Second Level Address Translation (SLAT).\nCPU support for VM Monitor Mode Extension (VT-c on Intel CPUs).\nMinimum of 4-GB memory.\n Note\n\nThe Hyper-V role can't be installed on Windows 10 Home or Windows 11 Home.\n\nFor more information and troubleshooting, see Windows Hyper-V System Requirements.\n\nEnable Hyper-V\nPowerShell\nGUI\nTo enable Hyper-V on Windows using PowerShell:\n\nOn the Windows desktop, select the Start button and type any part of the name Windows PowerShell.\n\nRight-click Windows PowerShell and select Run as Administrator.\n\n Important\n\nYou must run PowerShell as an Administrator, or the commands fail.\n\nRun the following command:\n\nPowerShell\nEnable-WindowsOptionalFeature -Online -FeatureName Microsoft-Hyper-V -All\nScreenshot of PowerShell window after running the command to enable Hyper-V.\n\nEnter Y to have the computer restart to complete the installation.\n\nTo enable the Hyper-V role on Windows using DISM:\n\nThe Deployment Image Servicing and Management tool (DISM) helps configure Windows and Windows images. Among its many applications, DISM can enable Windows features while the operating system is running.\n\nOn the Windows desktop, select the Start button and type any part of the name Windows PowerShell.\n\nRight-click Windows PowerShell and select Run as Administrator.\n\nType the following command:\n\nPowerShell\nDISM /Online /Enable-Feature /All /FeatureName:Microsoft-Hyper-V\nConsole window showing Hyper-V being enabled.\n\nYou see that the feature is enabled and that \"The operation completed successfully.\"\n\nFor more information about DISM, see the DISM Technical Reference.",
        "url": "https://www.appu.com",
        "created_at": "2025-12-29T22:21:17.060596"
    },
    {
        "id": "69709bb2-c432-49d9-968f-8d0cc9fe3fe9",
        "title": "dfsdf",
        "data": "asdfds<div>asdfsdf</div>",
        "url": "",
        "created_at": "2025-12-30T01:10:36.927177"
    }
]